[{"category":"Software Development","homepage_url":"https://bitbucket.org/product","id":"software-development--version-control--atlassian-bitbucket","logo_url":"http://127.0.0.1:8000/logos/275c1901cdf52560b8d9c915ec7daf7585e6433cff67ed8854960c4fe4201db2.svg","name":"Atlassian Bitbucket","subcategory":"Version Control","description":"Atlassian Bitbucket is a web-based platform that provides Git repository management, supporting source code collaboration for development teams. It offers features like code hosting, pull requests, code review, and continuous integration/continuous deployment (CI/CD) pipelines.  Bitbucket integrates seamlessly with other Atlassian products like Jira and Confluence, enabling comprehensive project tracking and documentation."},{"category":"Software Development","homepage_url":"https://github.com/","id":"software-development--version-control--github","logo_url":"http://127.0.0.1:8000/logos/7a0dd11e373830a51a565de9fed4a985707c67ccd390f9ae4946a152303ea676.svg","name":"GitHub","subcategory":"Version Control","description":"GitHub is a version control platform specifically built for software development. It lets developers host and collaborate on code, track changes, and manage projects. GitHub offers additional features like version control, which allows you to see how the code has changed over time, and collaboration tools that make it easy for multiple developers to work on a project together."},{"category":"Software Development","homepage_url":"https://about.gitlab.com","id":"software-development--version-control--gitlab","logo_url":"http://127.0.0.1:8000/logos/fbbec3a8a36db6cb6048aa6e15a6ad9b06b1feb6d4a4ed36cfa17a4fd54d8de7.svg","name":"Gitlab","subcategory":"Version Control","description":"GitLab is a web-based DevOps lifecycle tool that provides a Git repository manager, CI/CD pipeline features, and other capabilities for managing the entire  software development and deployment process. It enables teams to collaborate on code, manage projects, and automate workflows, supporting a seamless integration of coding, testing, and deployment tasks.","repositories":[{"url":"https://gitlab.com/gitlab-org/gitlab","primary":true}]}]