[{"category":"Cloud Computing","homepage_url":"https://aws.amazon.com/","id":"cloud-computing--cloud-providers--amazon-web-serivces-aws","logo_url":"http://127.0.0.1:8000/logos/bb6d8dbe7b0fddd49758ad5f0eb56f02868bbb40d52a9181410d8cd16dcd1b53.svg","name":"Amazon Web Serivces (AWS)","subcategory":"Cloud Providers","description":"Amazon Web Services (AWS) is a comprehensive and widely-used cloud computing platform offered by Amazon.  It provides a vast array of cloud services that include computing power, storage options, databases, networking, machine learning, analytics, and more. "},{"category":"Cloud Computing","homepage_url":"https://cloud.google.com","id":"cloud-computing--cloud-providers--google-cloud-platform","logo_url":"http://127.0.0.1:8000/logos/dafedcabb0df2873f5d740f527f58edd5c7d594106b83d485a8416611b39f996.svg","name":"Google Cloud Platform","subcategory":"Cloud Providers","description":"Google Cloud Platform (GCP) is a suite of cloud computing services provided by Google. It offers a wide range of services for computing, storage, databases, machine learning, networking, and developer tools that help businesses build, deploy, and scale applications and services. GCP's services include Google Compute Engine for virtual machines, Google Cloud Storage for object storage, Google Kubernetes Engine (GKE) for container orchestration, Google BigQuery for data analytics, and Google Cloud AI for machine learning and artificial intelligence."},{"category":"Cloud Computing","homepage_url":"https://azure.microsoft.com/","id":"cloud-computing--cloud-providers--microsoft-azure","logo_url":"http://127.0.0.1:8000/logos/421cba686dd16734a2702747e30a26a22c83b9ab8206170d256b511a97ffc693.svg","name":"Microsoft Azure","subcategory":"Cloud Providers","description":"Microsoft Azure is a comprehensive cloud computing platform and infrastructure offered by Microsoft.  It provides a wide range of services including computing power (virtual machines), storage solutions (Azure Blob Storage, Azure Files), databases (Azure SQL Database, Cosmos DB), networking services (Azure Virtual Network, Load Balancer), and developer tools (Azure DevOps, Azure Functions). "}]