{"categories":[{"category":"Technical Skills Landscape","subcategories":[{"subcategory":"Introduction","content":"<p>This visualization provides a comprehensive overview of Ricardo Henriques’ technical skill set,\nshowcasing his proficiency in various tools and technologies. Using a <a href=\"https://github.com/cncf/landscape2\">Landscape2</a> format,\nit illustrates the breadth and depth of his expertise, with a particular focus on Infrastructure as Code (IaC),\nContainers, Kubernetes (K8s), and Apache Kafka.</p>\n<p>This visual representation highlights the tools and technologies Ricardo has mastered and applied in recent projects,\noffering a clear insight into his capabilities and areas of strength.</p>\n<p>We will now break down each category, providing more information on how each tool was used.</p>\n"}]},{"category":"Software Development","content":"<p>This category highlights his experience with various tools and technologies used in modern software development,\nshowcasing his ability to create robust and reliable software solutions. His expertise spans multiple programming languages,\nframeworks, and development methodologies. Ricardo excels in writing clean, efficient, and scalable code,\nemploying best practices such as version control, continuous integration, and test-driven development.</p>\n","subcategories":[{"subcategory":"Version Control","content":"<h4>Tools</h4>\n<p>In the Version Control sub-category, Ricardo Henriques primarily utilizes GitHub and other git-related solutions such as GitLab and Bitbucket.\nAdditionally, he has experience with tools like Perforce.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo is well-acquainted with branch models such as Gitflow and principles such as GitOps, ensuring efficient\nand organized management of code changes and collaboration within development teams.</p>\n<p>Ricardo leverages pull request templates to standardize contributions and employs branch protection rules to maintain code integrity.\nHe integrates various checks before merges, including build triggers, linting tools, and semantic PR rules, to ensure high code quality and consistency.</p>\n"},{"subcategory":"Build Tools","content":"<h4>Tools</h4>\n<p>In the Build Tools sub-category, Ricardo Henriques has recently focused on using Maven for Java projects and Python Poetry for Python projects.\nHe also has experience building pipelines for other languages, such as Go. Ricardo is proficient in setting up and maintaining efficient\nbuild processes to ensure seamless integration and deployment.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo adheres to best practices in software development, employing robust test frameworks and ensuring high test coverage.\nThis commitment to quality helps maintain reliable and maintainable codebases, facilitating smoother development and deployment cycles.</p>\n"},{"subcategory":"Artifact Repositories","content":"<h4>Tools</h4>\n<p>In the Artifact Repositories sub-category, Ricardo Henriques has been responsible for deploying and managing tools such as JFrog and Nexus.\nHis responsibilities included setting up the entire backend infrastructure, creating monitoring, alerting, and backup and restore procedures.\nAdditionally, he has experience using AWS CodeArtifact and GitHub Packages.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo has experience working with various repository setups, including direct access to external repositories, internal repositories, and proxy repositories.\nThis flexibility ensures that development teams can efficiently access and manage their artifacts regardless of the setup.</p>\n"},{"subcategory":"Continuous Integration and Continuous Deployment (CI/CD)","content":"<h4>Tools</h4>\n<p>In the CI/CD sub-category, Ricardo Henriques has extensive experience with tools such as Jenkins, which is the most frequently used, as well as TeamCity and Octopus Deploy.\nHe has successfully set up and maintained CI/CD pipelines to streamline the software development lifecycle.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo strives to create templates and shared libraries to facilitate the adoption of new setups, ensuring consistency and efficiency across projects.\nHe also emphasizes automating testing, building, and deployment processes to minimize manual intervention and reduce errors.</p>\n"},{"subcategory":"Infrastructure as Code (IaC)","content":"<h4>Tools</h4>\n<p>In the IaC sub-category, Ricardo Henriques has a strong background using tools such as Terraform, Ansible, and Checkov.\nHe excels in automating infrastructure provisioning, configuration management, and compliance checks to ensure consistent and reliable deployments.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo emphasizes the importance of versioning infrastructure code, enabling rollbacks and tracking changes efficiently.\nHe advocates for using modular and reusable code to streamline the management of complex environments.\nAdditionally, he integrates infrastructure testing into CI/CD pipelines to validate changes before deployment, ensuring stability and security.</p>\n"}]},{"category":"Cloud Computing","content":"<p>In the Cloud Computing category, Ricardo Henriques demonstrates significant expertise in containerization and orchestration technologies,\nas well as extensive experience with various cloud service providers. He excels in designing, deploying, and managing scalable\nand resilient cloud-based infrastructure to support modern applications.</p>\n","subcategories":[{"subcategory":"Containerization and Orchestration","content":"<h4>Tools</h4>\n<p>Ricardo is proficient in creating and managing containerized applications using Docker and has experience with Podman as an alternative containerization tool.\nHe utilizes Kind and Minikube for setting up local Kubernetes environments, facilitating development and testing processes.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo is adept at creating local development environments using tools like Kind and Minikube.\nHe has expertise in building Docker images with best practices that leverage layers and ensure security.\nAdditionally, he uses Helm to create charts that standardize application deployments across various environments.</p>\n"},{"subcategory":"Cloud Providers","content":"<h4>Tools</h4>\n<p>Ricardo has extensive experience with Amazon Web Services (AWS) and some experience with Google Cloud Platform (GCP) and Microsoft Azure.</p>\n<h4>Ways of Work</h4>\n<p>In AWS, Ricardo leverages cloud services to achieve optimal performance, cost efficiency, and scalability for various applications and workloads.\nIn GCP, he utilizes the Kubernetes Engine to manage container orchestration effectively. For Azure, he has experience in managing Azure AD for\nidentity and access management, ensuring secure and streamlined access controls.</p>\n"}]},{"category":"Security","content":"<p>In the Security category, we will delve into essential aspects of safeguarding infrastructure and applications.\nThis section will cover Identity and Access Management (IAM), Secret Management, and Service Mesh.\nRicardo Henriques has a robust understanding of these areas, ensuring that security best practices are implemented across all stages of development and deployment.</p>\n","subcategories":[{"subcategory":"Identity and Access Management (IAM)","content":"<h4>Tools</h4>\n<p>Ricardo is proficient in using Azure Active Directory (AD), OpenLDAP, and Kerberos for identity and access management.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo has extensive experience connecting Azure AD to be used as a Single Sign-On (SSO) mechanism for several external tools,\nenhancing security and simplifying user access management.\nWith Kerberos and OpenLDAP, he has deployed, managed, and integrated these services with both Linux and Windows environments,\nensuring seamless and secure authentication across diverse systems.</p>\n"},{"subcategory":"Secrets Management","content":"<h4>Tools</h4>\n<p>Ricardo utilizes Vault for secret management, ensuring the secure storage and handling of sensitive information.</p>\n<h4>Ways of Work</h4>\n<p>Secret management is typically integrated into CI/CD pipelines, providing automated and secure access to secrets during build and deployment processes.\nAdditionally, internal secret management solutions are sometimes used for different tools to maintain a consistent and secure approach across\nthe entire development lifecycle.</p>\n"},{"subcategory":"Service Mesh","content":"<h4>Tools</h4>\n<p>Ricardo primarily uses Istio for service mesh implementations, though he has also evaluated alternatives such as HashiCorp Consul.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo has experience deploying Istio on Kubernetes clusters to leverage its security capabilities for service-to-service communication within the cluster.\nThis includes securing communication in a Kafka cluster and its consumer and producer clients.\nAdditionally, Ricardo uses Istio to enhance observability, ensuring comprehensive monitoring and visibility into the service interactions within the cluster.</p>\n"}]},{"category":"Databases and Data Stores","content":"<p>In the Databases and Data Stores category, we will explore various aspects of data management and processing.\nThis section will cover Relational Database Management Systems (RDBMS), Monitoring and Logging, Search and Analytics, Big Data and Stream Processing, and NoSQL Databases.\nRicardo Henriques has extensive experience in these areas, ensuring efficient, scalable, and secure handling of data across different platforms and use cases.</p>\n","subcategories":[{"subcategory":"Relational Database Management Systems (RDBMS)","content":"<h4>Tools</h4>\n<p>Before transitioning into DevOps, Ricardo Henriques was an experienced DBA.\nHe began his journey with IBM Informix and then expanded his expertise to other technologies such as Oracle and Microsoft SQL Server.</p>\n<h4>Ways of Work</h4>\n<p>Although Ricardo is no longer directly involved in DBA tasks, he still deploys small database instances in containers and more robust ones using cloud services like Amazon RDS,\ntypically opting for MySQL or PostgreSQL.\nHis background as a DBA informs his approach to managing and deploying these databases, ensuring they are optimized for performance and reliability.</p>\n"},{"subcategory":"Monitoring and Logging","content":"<h4>Tools</h4>\n<p>Ricardo has extensive experience with Prometheus and Grafana for monitoring and logging.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo utilizes the Prometheus Operator with tools such as pod or service monitors and scrape configs to efficiently collect and manage metrics.\nFor visualization, he uses Grafana to import pre-built dashboards and to create custom ones, tailoring them to\nspecific monitoring needs and providing comprehensive insights into system performance and health.</p>\n"},{"subcategory":"Search and Analytics","content":"<h4>Tools</h4>\n<p>Ricardo has worked with Elasticsearch, although not as extensively as desired, and DataHub.</p>\n<h4>Ways of Work</h4>\n<p>Elasticsearch was one of the first tools Ricardo used in his DevOps journey and remains a favorite despite not being used frequently.\nHe recently created a small proof of concept (PoC) to showcase the Security Information and Event Management (SIEM) capabilities of Elastic Security.\nAdditionally, Ricardo was responsible for deploying a self-managed DataHub using AWS resources and demonstrated its capabilities by ingesting metadata from different sources,\nshowcasing the power and versatility of DataHub in metadata management and analytics.</p>\n"},{"subcategory":"Big Data and Stream Processing","content":"<h4>Tools</h4>\n<p>Ricardo is an expert Kafka Administrator with advanced experience in Spark from his days as a Hadoop Administrator and has great experience with Airflow.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo has advanced experience in the entire Kafka ecosystem as an administrator, including deploying and managing core tools\n(brokers, Zookeeper, Connect clusters, and Schema Registry). He also assists in creating pipelines for applications and managing Kafka topics and ACLs.\nFor Spark, Ricardo has helped developers transition from using a Hadoop cluster to leveraging Kubernetes as the resource manager,\nutilizing Airflow as the job orchestrator to run Spark jobs efficiently and effectively.</p>\n"},{"subcategory":"NoSQL Databases","content":"<h4>Tools</h4>\n<p>Ricardo has experience with MongoDB and Cassandra, though not extensively.</p>\n<h4>Ways of Work</h4>\n<p>Ricardo has typically been involved in the deployment and management of MongoDB and Cassandra in less mature environments.\nHis experience includes setting up these NoSQL databases and ensuring their basic operational functionality.</p>\n"}]},{"category":"Amazon Web Services (AWS)","content":"<h4>Tools</h4>\n<p>As the cloud provider with which Ricardo Henriques has the most experience, Amazon Web Services (AWS) plays a central role in his cloud management portfolio.\nRicardo extensively uses AWS Identity and Access Management (IAM) for secure access control, and storage solutions like S3, EFS, and DataSync for robust data management.\nHe leverages managed services such as RDS, MKS, and OpenSearch to streamline database and search operations.\nFor containerized applications, Ricardo utilizes the Elastic Kubernetes Service (EKS) and supports users with analytic tools like Athena and Glue.</p>\n<h4>Ways of Work</h4>\n<p>Managing AWS cloud resources is done through Infrastructure as Code (IaC) and CI/CD pipelines, ensuring all configurations and deployments are pre-checked and automated for efficiency and reliability.</p>\n"}]}